In [27]:
import pandas as pd
import numpy as np

In [28]:
df1 = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df2 = pd.DataFrame([[10, 11, 12], [14, 15, 16], [18, 19, 20]])

In [29]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [30]:
df2

    0   1   2
0  10  11  12
1  14  15  16
2  18  19  20

In [31]:
df1.T

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [32]:
df2.T

    0   1   2
0  10  14  18
1  11  15  19
2  12  16  20

In [33]:
df1+df2

    0   1   2
0  11  13  15
1  18  20  22
2  25  27  29

In [34]:
df2-df1

    0   1   2
0   9   9   9
1  10  10  10
2  11  11  11

In [35]:
df1*df2

     0    1    2
0   10   22   36
1   56   75   96
2  126  152  180

In [36]:
df1.dot(df2)

     0    1    2
0   92   98  104
1  218  233  248
2  344  368  392